<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"sandbox","backend":"48d32ee6bd26e30e967e599b064f270425d08bd0baea6019dece675a2a22a7ea","plan_job_ref":"Job .github/workflows/_test-tf.yaml #236 at https://github.com/tx-pts-dai/github-workflows/actions/runs/12766876647","plan_out_hash":"6e44168aa668f26c6c00fe679cf4a0b643c987ce8aeb9b9bac7e97b4818391f5","plan_hash":"fe9c7be7d12e466283f9689492fcb0e5826f154cfa28e01b25fb8da5e995dec9","plan_text_format":"diff","version":"1.46.0"} -->
Terraform plan for __sandbox__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.this will be created
+   resource "random_id" "this" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 4
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

  # random_pet.this will be created
+   resource "random_pet" "this" {
+       id        = (known after apply)
+       length    = 2
+       separator = "-"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   random_id  = (known after apply)
+   random_pet = (known after apply)
```
</details>

:memo: Plan generated in [.github/workflows/_test-tf.yaml #236](https://github.com/tx-pts-dai/github-workflows/actions/runs/12766876647)